In [2]:
#Series
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
#Means you don't have to write pd.series or pd.dataframe all the time

In [3]:
#Series indexes values, they are numbered
obj = Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
#If you wanna see values as array
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [5]:
obj.index
#shows series index

RangeIndex(start=0, stop=4, step=1)

In [6]:
#name the index
ww2_cas=Series([87000,43000,30000,21000,4000], index=['USSR','Germany','China','Japan','USA'])
ww2_cas

USSR       87000
Germany    43000
China      30000
Japan      21000
USA         4000
dtype: int64

In [7]:
ww2_cas['USA']

4000

In [8]:
#To check which countries has casualties over a certain number for example
ww2_cas[ww2_cas>40000]

USSR       87000
Germany    43000
dtype: int64

In [9]:
'USSR' in ww2_cas

True

In [10]:
#Convert series into dictionary
ww2_dict=ww2_cas.to_dict()
ww2_dict

{'USSR': 87000, 'Germany': 43000, 'China': 30000, 'Japan': 21000, 'USA': 4000}

In [11]:
ww2_series=Series(ww2_dict)
ww2_series

USSR       87000
Germany    43000
China      30000
Japan      21000
USA         4000
dtype: int64

In [12]:
countries=['China','Germany','Japan','USA','USSR','Argentina']

In [14]:
obj2=Series(ww2_dict,index=countries)
#setting index to another list in series
obj2

China        30000.0
Germany      43000.0
Japan        21000.0
USA           4000.0
USSR         87000.0
Argentina        NaN
dtype: float64

In [15]:
pd.isnull(obj2)
#tells you if there is a null value

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [16]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [17]:
ww2_series + obj2

Argentina         NaN
China         60000.0
Germany       86000.0
Japan         42000.0
USA            8000.0
USSR         174000.0
dtype: float64

In [18]:
#name values
obj2.name="WW2 Casualties"
obj2

China        30000.0
Germany      43000.0
Japan        21000.0
USA           4000.0
USSR         87000.0
Argentina        NaN
Name: WW2 Casualties, dtype: float64

In [20]:
#name index
obj2.index.name='Countries'
obj2

Countries
China        30000.0
Germany      43000.0
Japan        21000.0
USA           4000.0
USSR         87000.0
Argentina        NaN
Name: WW2 Casualties, dtype: float64

In [21]:
#Dataframe

In [32]:
#data copied from nfl win loss record wikipedia, copy and write this
nfl_frame= pd.read_clipboard()
nfl_frame

   1        Dallas Cowboys    947  538  403   6   .571  1960   NFC East
0  2     Green Bay Packers  1,414  787  589  38  0.570  1921  NFC North
1  3  New England Patriots    949  529  411   9  0.562  1960   AFC East
2  4      Baltimore Ravens    417  233  183   1  0.560  1996  AFC North
3  5         Chicago Bears  1,448  786  620  42  0.557  1920  NFC North

In [31]:
nfl_frame.columns
#gives you column names

Index(['1', 'Dallas Cowboys', '947', '538', '403', '6', '.571', '1960',
       'NFC East'],
      dtype='object')

In [29]:
nfl_frame['Dallas Cowboys']

0       Green Bay Packers
1    New England Patriots
2        Baltimore Ravens
3           Chicago Bears
Name: Dallas Cowboys, dtype: object

In [33]:
DataFrame(nfl_frame,columns=['Dallas Cowboys','947','538'])
#make new dataframe with selected columns

         Dallas Cowboys    947  538
0     Green Bay Packers  1,414  787
1  New England Patriots    949  529
2      Baltimore Ravens    417  233
3         Chicago Bears  1,448  786

In [34]:
DataFrame(nfl_frame, columns=['Dallas Cowboys','947','538','Stadium'])
#add new column that doesn't exist yet

         Dallas Cowboys    947  538  Stadium
0     Green Bay Packers  1,414  787      NaN
1  New England Patriots    949  529      NaN
2      Baltimore Ravens    417  233      NaN
3         Chicago Bears  1,448  786      NaN

In [39]:
#retrieve rows instead, head(number of first rows you want), tail(number of last rows you want)
nfl_frame.head(3)

   1        Dallas Cowboys    947  538  403   6   .571  1960   NFC East
0  2     Green Bay Packers  1,414  787  589  38  0.570  1921  NFC North
1  3  New England Patriots    949  529  411   9  0.562  1960   AFC East
2  4      Baltimore Ravens    417  233  183   1  0.560  1996  AFC North

In [46]:
nfl_frame.loc[3]
#retrieve specific index row

1                             5
Dallas Cowboys    Chicago Bears
947                       1,448
538                         786
403                         620
6                            42
.571                      0.557
1960                       1920
NFC East              NFC North
Name: 3, dtype: object

In [47]:
nfl_frame['Stadium']='Levis Stadium'
nfl_frame

,1,Dallas Cowboys,947,538,403,6,.571,1960,NFC East,Stadium
0,2,Green Bay Packers,"1,414",787,589,38,0.570,1921,NFC North,Levis Stadium
1,3,New England Patriots,949,529,411,9,0.562,1960,AFC East,Levis Stadium
2,4,Baltimore Ravens,417,233,183,1,0.560,1996,AFC North,Levis Stadium
3,5,Chicago Bears,"1,448",786,620,42,0.557,1920,NFC North,Levis Stadium

In [51]:
#makes column an array
nfl_frame["Stadium"]=np.arange(4)
nfl_frame

,1,Dallas Cowboys,947,538,403,6,.571,1960,NFC East,Stadium
0,2,Green Bay Packers,"1,414",787,589,38,0.570,1921,NFC North,0
1,3,New England Patriots,949,529,411,9,0.562,1960,AFC East,1
2,4,Baltimore Ravens,417,233,183,1,0.560,1996,AFC North,2
3,5,Chicago Bears,"1,448",786,620,42,0.557,1920,NFC North,3

In [54]:
#make series
stadiums=Series(['Levis Stadium','AT&T Stadium'], index=[3,0])
stadiums

3    Levis Stadium
0     AT&T Stadium
dtype: object

In [55]:
nfl_frame['Stadium']=stadiums
#set df column to the series
nfl_frame

,1,Dallas Cowboys,947,538,403,6,.571,1960,NFC East,Stadium
0,2,Green Bay Packers,"1,414",787,589,38,0.570,1921,NFC North,AT&T Stadium
1,3,New England Patriots,949,529,411,9,0.562,1960,AFC East,NaN
2,4,Baltimore Ravens,417,233,183,1,0.560,1996,AFC North,NaN
3,5,Chicago Bears,"1,448",786,620,42,0.557,1920,NFC North,Levis Stadium

In [56]:
#delete entire columns
del nfl_frame['Stadium']
nfl_frame

   1        Dallas Cowboys    947  538  403   6   .571  1960   NFC East
0  2     Green Bay Packers  1,414  787  589  38  0.570  1921  NFC North
1  3  New England Patriots    949  529  411   9  0.562  1960   AFC East
2  4      Baltimore Ravens    417  233  183   1  0.560  1996  AFC North
3  5         Chicago Bears  1,448  786  620  42  0.557  1920  NFC North

In [57]:
data ={'City':['SF','LA','NYC'],'Polulation':[837000,3880000,840000]}

In [58]:
city_frame=DataFrame(data)
city_frame

  City  Polulation
0   SF      837000
1   LA     3880000
2  NYC      840000

In [59]:
#Index Objects

In [60]:
my_ser=Series([1,2,3,4],index=['A','B','C','D'])
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [61]:
my_index=my_ser.index
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [63]:
my_index[2:]

Index(['C', 'D'], dtype='object')

In [64]:
my_index[0]='W'
#cannot change indexes like this

TypeError: Index does not support mutable operations

In [65]:
#Reindexing

In [66]:
from numpy.random import randn

In [67]:
ser1=Series([1,2,3,4],index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [69]:
ser2=ser1.reindex(['A','B','C','D','E','F'])
ser2
#reindexing

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [71]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)
#makes new indexes filled with input value

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [73]:
ser3=Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [75]:
ranger=range(15)
#list up to 15
ser3.reindex(ranger,method='ffill')
#ffill means forward fill, reindex(new index, method = method of fill)

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [78]:
dframe=DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
dframe
#making dataframe from scratch

       col1      col2      col3      col4      col5
A -0.433262  0.520050 -1.470595 -0.130507  0.362758
B -0.450887 -0.445119 -0.678957  0.720507 -1.037001
D -1.718072  2.549748 -0.646818  0.098890  0.151457
E -0.054024 -1.240902  1.193944  1.014467 -0.300769
F -1.256554 -0.976199  0.219431 -1.720743  1.300529

In [80]:
dframe2=dframe.reindex(['A','B','C','D','E','F'])
dframe2
#add index row

       col1      col2      col3      col4      col5
A -0.433262  0.520050 -1.470595 -0.130507  0.362758
B -0.450887 -0.445119 -0.678957  0.720507 -1.037001
C       NaN       NaN       NaN       NaN       NaN
D -1.718072  2.549748 -0.646818  0.098890  0.151457
E -0.054024 -1.240902  1.193944  1.014467 -0.300769
F -1.256554 -0.976199  0.219431 -1.720743  1.300529

In [81]:
new_columns = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns=new_columns)
#reindex(columns=the list of updated columns)

       col1      col2      col3      col4      col5  col6
A -0.433262  0.520050 -1.470595 -0.130507  0.362758   NaN
B -0.450887 -0.445119 -0.678957  0.720507 -1.037001   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.718072  2.549748 -0.646818  0.098890  0.151457   NaN
E -0.054024 -1.240902  1.193944  1.014467 -0.300769   NaN
F -1.256554 -0.976199  0.219431 -1.720743  1.300529   NaN

In [88]:
#Drop Entry

In [90]:
ser1=Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [91]:
#drop an index from series
ser1.drop('b')

a    0
c    2
dtype: int32

In [92]:
dframe1=DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [95]:
dframe2=dframe1.drop('LA')
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [103]:
dframe1.drop('year',axis=1)
#When dropping columns, you need to specify axis=1, axis=0 is default and those are rows

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [104]:
#Selecting Entries

In [105]:
ser1=Series(np.arange(3), index=['A','B','C'])
ser1=2*ser1
#Doubled every value in series
ser1

A    0
B    2
C    4
dtype: int32

In [106]:
ser1['B']
#Call 2 with index

2

In [107]:
ser1[1]
#Calls number of index, so this would be 2

2

In [108]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [109]:
ser1[ser1>3]

C    4
dtype: int32

In [111]:
dframe=DataFrame(np.arange(25).reshape((5,5)), index=['NY','LA','SF','DC','Chi'], columns= ['A','B','C','D','E'])
dframe

      A   B   C   D   E
NY    0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [114]:
dframe[['B','E']]

      B   E
NY    1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [115]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [116]:
dframe>10

         A      B      C      D      E
NY   False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [117]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [119]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [120]:
#Data alignment

In [125]:
ser1=Series([0,1,2], index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [126]:
ser2=Series([3,4,5,6], index = ['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [127]:
ser1+ser2
#Add 2 unequal series together

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [129]:
dframe1=DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [133]:
dframe2=DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [135]:
dframe1+dframe2
#Same thing as before, only where row and column match up does it work

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [136]:
dframe1.add(dframe2,fill_value=0)
#Fills in values of dframe1 as zero, adds dframe values to it

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [137]:
ser3=dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [138]:
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [139]:
#Ranking and Sorting

In [140]:
ser1=Series(range(3),index=['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int64

In [142]:
ser1.sort_index()
#sorts index values

A    1
B    2
C    0
dtype: int64

In [144]:
ser1.sort_values()
#sorts by values

C    0
A    1
B    2
dtype: int64

In [145]:
ser2=Series(randn(10))
ser2

0    2.028864
1    0.807332
2   -0.491700
3    0.412175
4   -0.648393
5    0.423856
6   -0.675745
7   -0.151399
8    0.552185
9    0.344931
dtype: float64

In [146]:
ser2.sort_values()

6   -0.675745
4   -0.648393
2   -0.491700
7   -0.151399
9    0.344931
3    0.412175
5    0.423856
8    0.552185
1    0.807332
0    2.028864
dtype: float64

In [147]:
#Each value is ranked, to know the rank do this
ser2.rank()

0    10.0
1     9.0
2     3.0
3     6.0
4     2.0
5     7.0
6     1.0
7     4.0
8     8.0
9     5.0
dtype: float64

In [149]:
ser3=Series(randn(10))
ser3

0    0.918242
1    0.100695
2    3.593095
3   -0.212938
4    0.915433
5    0.352049
6   -0.260280
7   -0.162333
8    0.858290
9    0.092905
dtype: float64

In [150]:
ser3.rank()

0     9.0
1     5.0
2    10.0
3     2.0
4     8.0
5     6.0
6     1.0
7     3.0
8     7.0
9     4.0
dtype: float64

In [152]:
ser3.sort_values()

6   -0.260280
3   -0.212938
7   -0.162333
9    0.092905
1    0.100695
5    0.352049
8    0.858290
4    0.915433
0    0.918242
2    3.593095
dtype: float64

In [153]:
ser3.rank()

0     9.0
1     5.0
2    10.0
3     2.0
4     8.0
5     6.0
6     1.0
7     3.0
8     7.0
9     4.0
dtype: float64

In [154]:
#Summary Statistics

In [156]:
arr=np.array([[1,2,np.nan],[np.nan,3,4]])
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [157]:
dframe1=DataFrame(arr, index=['A','B'],columns=['One','Two','Three'])
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [158]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [159]:
dframe1.sum(axis=1)
#sums rows

A    3.0
B    7.0
dtype: float64

In [161]:
dframe1.min(axis=1)

A    1.0
B    3.0
dtype: float64

In [164]:
dframe1.idxmin(axis=0)
#gives index of min value

One      A
Two      A
Three    B
dtype: object

In [169]:
dframe1.cumsum()
#cumulation sum of columns, for rows use axis=1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [170]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [179]:
from pandas_datareader import data as pdweb
import datetime
#gets info off web and imports the date and time

ModuleNotFoundError: No module named 'pandas_datareader'

In [180]:
prices = pdweb.get_data_yahoo(['CVX','XNM','BP'], start=datetime.datetime(2010,1,1),end=datetime.datetime(2013,1,1))['Adj Close']
prices.head()
#Lets you get data off the internet

NameError: name 'pdweb' is not defined

In [181]:
volume = pdweb.get_data_yahoo (['CVX','XNM','BP'], start=datetime.datetime(2010,1,1),end=datetime.datetime(2013,1,1))['Volume']
volume.head()
#Makes dataframe of volume

SyntaxError: invalid syntax (2654898003.py, line 1)

In [182]:
rets= prices.pct_change()
#returns on stocks

NameError: name 'prices' is not defined

In [183]:
#correlation of the stocks
corr=rets.corr

In [184]:
%matplotlib inline
prices.plot()
#plots prices, first line makes plot visible

NameError: name 'prices' is not defined

In [185]:
import seaborn as sns
#plotting library
import matplotlib.pyplot as plt

In [186]:
sns.corrplot(rets,annot=false,diag_names=false)

AttributeError: module 'seaborn' has no attribute 'corrplot'

In [187]:
ser1=Series(['w','w','x','y','z','w','x','y','x','a'])
ser1

0    w
1    w
2    x
3    y
4    z
5    w
6    x
7    y
8    x
9    a
dtype: object

In [188]:
ser1.unique()
#returns array with unique values

array(['w', 'x', 'y', 'z', 'a'], dtype=object)

In [189]:
ser1.value_counts()

w    3
x    3
y    2
z    1
a    1
dtype: int64

In [190]:
#Missing Data

In [191]:
data=Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [192]:
data.isnull()
#tells you if a value is null

0    False
1    False
2     True
3    False
dtype: bool

In [193]:
data.dropna()
#removes any null value

0     one
1     two
3    four
dtype: object

In [194]:
dframe=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9], [np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [195]:
clean_frame = dframe.dropna()
#works the same way in dataframe
clean_frame

     0    1    2
0  1.0  2.0  3.0

In [196]:
dframe.dropna(how='all')
#drops rows where all data is null

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [198]:
dframe.dropna(how='all',axis=1)
#drops column with all null values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [199]:
npn=np.nan
dframe2=DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [200]:
dframe2.dropna(thresh=2)
#removes rows with under 2 datapoints, 2 points is the threshhold

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [201]:
dframe2.fillna(1)
#fills null values with what's in the parenthesis

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [202]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [203]:
dframe2.fillna({0:0,1:1,2:2,3:3})
#fill different columns with different values by using dictionary

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [204]:
#Index Hierarchy

In [206]:
ser=Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser
#when 2 indexes are used, pandas gives you levels of indexes, with subgroups made

1  a   -0.021699
   b    0.296477
   c   -0.179874
2  a    0.737543
   b   -0.455106
   c    0.308988
dtype: float64

In [207]:
ser[1]

a   -0.021699
b    0.296477
c   -0.179874
dtype: float64

In [210]:
#to index a subgroup, 'a' for example, use colon 
ser[:,'a']

1   -0.021699
2    0.737543
dtype: float64

In [212]:
dframe= ser.unstack()
dframe
#creates data frame out of multi indexed series

          a         b         c
1 -0.021699  0.296477 -0.179874
2  0.737543 -0.455106  0.308988

In [220]:
dframe2=DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]], columns=[['NY','NY','SF','LA'],['cold','hot','hot','cold']])
dframe2
#double indexed on both axis

      NY      SF   LA
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [221]:
dframe2.index.names=['INDEX_1','INDEX_2']
dframe2.columns.names=['Cities','Temp']
dframe2
#names indexes

Cities            NY      SF   LA
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [224]:
dframe2.swaplevel('Cities','Temp',axis=1)
#changes the hierarchy, whats on top and bottom

Temp            cold hot     cold
Cities            NY  NY  SF   LA
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [229]:
dframe2

Cities            NY      SF   LA
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [228]:
dframe2.groupby(level='Temp',axis=1).sum()
#sums up the rows in a chosen hierarchy, in this case, Temp

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27